; domain
(define (domain zeno-travel)
(:requirements :typing :fluents)
(:types aircraft person city - object)
(:predicates (at ?x - (either person aircraft) ?c - city)
             (in ?p - person ?a - aircraft))
(:functions (fuel ?a - aircraft)
            (distance ?c1 - city ?c2 - city)
            (slow-burn ?a - aircraft)
            (fast-burn ?a - aircraft)
            (capacity ?a - aircraft)
            (total-fuel-used)
	    (onboard ?a - aircraft)
            (zoom-limit ?a - aircraft)
            )


(:action board
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (at ?p ?c)
                 (at ?a ?c))
 :effect (and (not (at ?p ?c))
              (in ?p ?a)
		(increase (onboard ?a) 1)))


(:action debark
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (in ?p ?a)
                 (at ?a ?c))
 :effect (and (not (in ?p ?a))
              (at ?p ?c)
		(decrease (onboard ?a) 1)))

(:action fly 
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a))))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (slow-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a)))))
                                  
(:action zoom
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
                 (<= (onboard ?a) (zoom-limit ?a)))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
	)
) 

(:action refuel	
 :parameters (?a - aircraft ?c - city)
 :precondition (and (> (capacity ?a) (fuel ?a))
               (at ?a ?c)
		)
 :effect (and (assign (fuel ?a) (capacity ?a)))
)


)

; problem
(define (problem ZTRAVEL-5-10)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	plane2 - aircraft
	plane3 - aircraft
	plane4 - aircraft
	plane5 - aircraft
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	person9 - person
	person10 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	)
(:init
	(at plane1 city0)
	(= (capacity plane1) 11322)
	(= (fuel plane1) 398)
	(= (slow-burn plane1) 4)
	(= (fast-burn plane1) 9)
	(= (onboard plane1) 0)
	(= (zoom-limit plane1) 4)
	(at plane2 city2)
	(= (capacity plane2) 4748)
	(= (fuel plane2) 1396)
	(= (slow-burn plane2) 2)
	(= (fast-burn plane2) 4)
	(= (onboard plane2) 0)
	(= (zoom-limit plane2) 9)
	(at plane3 city2)
	(= (capacity plane3) 8507)
	(= (fuel plane3) 161)
	(= (slow-burn plane3) 3)
	(= (fast-burn plane3) 6)
	(= (onboard plane3) 0)
	(= (zoom-limit plane3) 2)
	(at plane4 city0)
	(= (capacity plane4) 15472)
	(= (fuel plane4) 2146)
	(= (slow-burn plane4) 5)
	(= (fast-burn plane4) 18)
	(= (onboard plane4) 0)
	(= (zoom-limit plane4) 3)
	(at plane5 city2)
	(= (capacity plane5) 11656)
	(= (fuel plane5) 1368)
	(= (slow-burn plane5) 4)
	(= (fast-burn plane5) 9)
	(= (onboard plane5) 0)
	(= (zoom-limit plane5) 4)
	(at person1 city1)
	(at person2 city0)
	(at person3 city2)
	(at person4 city2)
	(at person5 city1)
	(at person6 city3)
	(at person7 city0)
	(at person8 city1)
	(at person9 city3)
	(at person10 city3)
	(= (distance city0 city0) 0)
	(= (distance city0 city1) 999)
	(= (distance city0 city2) 631)
	(= (distance city0 city3) 607)
	(= (distance city1 city0) 999)
	(= (distance city1 city1) 0)
	(= (distance city1 city2) 730)
	(= (distance city1 city3) 526)
	(= (distance city2 city0) 631)
	(= (distance city2 city1) 730)
	(= (distance city2 city2) 0)
	(= (distance city2 city3) 783)
	(= (distance city3 city0) 607)
	(= (distance city3 city1) 526)
	(= (distance city3 city2) 783)
	(= (distance city3 city3) 0)
	(= (total-fuel-used) 0)
)
(:goal (and
	(at plane3 city3)
	(at plane4 city3)
	(at plane5 city0)
	(at person1 city0)
	(at person2 city0)
	(at person3 city1)
	(at person4 city0)
	(at person5 city2)
	(at person6 city1)
	(at person7 city1)
	(at person8 city0)
	(at person9 city3)
	(at person10 city3)
	))

(:metric minimize (+ (* 2 (total-time))  (* 5 (total-fuel-used))))
)

; plan
1. (refuel plane4 city0)
   changed: (fuel plane4) from 2146 to 15472
   goals met: 3 of 13
2. (board person4 plane2 city2)
   deleted: (at person4 city2)
   added: (in person4 plane2)
   changed: (onboard plane2) from 0 to 1
   goals met: 3 of 13
3. (refuel plane5 city2)
   changed: (fuel plane5) from 1368 to 11656
   goals met: 3 of 13
4. (board person3 plane5 city2)
   deleted: (at person3 city2)
   added: (in person3 plane5)
   changed: (onboard plane5) from 0 to 1
   goals met: 3 of 13
5. (fly plane5 city2 city0)
   deleted: (at plane5 city2)
   added: (at plane5 city0)
   changed: (total-fuel-used) from 0 to 2524, (fuel plane5) from 11656 to 9132
   goals met: 4 of 13
6. (fly plane2 city2 city0)
   deleted: (at plane2 city2)
   added: (at plane2 city0)
   changed: (total-fuel-used) from 2524 to 3786, (fuel plane2) from 1396 to 134
   goals met: 4 of 13
7. (refuel plane3 city2)
   changed: (fuel plane3) from 161 to 8507
   goals met: 4 of 13
8. (zoom plane3 city2 city3)
   deleted: (at plane3 city2)
   added: (at plane3 city3)
   changed: (total-fuel-used) from 3786 to 8484, (fuel plane3) from 8507 to 3809
   goals met: 5 of 13
9. (zoom plane4 city0 city3)
   deleted: (at plane4 city0)
   added: (at plane4 city3)
   changed: (total-fuel-used) from 8484 to 19410, (fuel plane4) from 15472 to 4546
   goals met: 6 of 13
10. (debark person4 plane2 city0)
   deleted: (in person4 plane2)
   added: (at person4 city0)
   changed: (onboard plane2) from 1 to 0
   goals met: 7 of 13
11. (board person6 plane4 city3)
   deleted: (at person6 city3)
   added: (in person6 plane4)
   changed: (onboard plane4) from 0 to 1
   goals met: 7 of 13
12. (board person7 plane5 city0)
   deleted: (at person7 city0)
   added: (in person7 plane5)
   changed: (onboard plane5) from 1 to 2
   goals met: 7 of 13
13. (fly plane5 city0 city1)
   deleted: (at plane5 city0)
   added: (at plane5 city1)
   changed: (total-fuel-used) from 19410 to 23406, (fuel plane5) from 9132 to 5136
   goals met: 6 of 13
14. (debark person3 plane5 city1)
   deleted: (in person3 plane5)
   added: (at person3 city1)
   changed: (onboard plane5) from 2 to 1
   goals met: 7 of 13
15. (debark person7 plane5 city1)
   deleted: (in person7 plane5)
   added: (at person7 city1)
   changed: (onboard plane5) from 1 to 0
   goals met: 8 of 13
16. (board person1 plane5 city1)
   deleted: (at person1 city1)
   added: (in person1 plane5)
   changed: (onboard plane5) from 0 to 1
   goals met: 8 of 13
17. (board person5 plane5 city1)
   deleted: (at person5 city1)
   added: (in person5 plane5)
   changed: (onboard plane5) from 1 to 2
   goals met: 8 of 13
18. (board person8 plane5 city1)
   deleted: (at person8 city1)
   added: (in person8 plane5)
   changed: (onboard plane5) from 2 to 3
   goals met: 8 of 13
19. (fly plane5 city1 city2)
   deleted: (at plane5 city1)
   added: (at plane5 city2)
   changed: (total-fuel-used) from 23406 to 26326, (fuel plane5) from 5136 to 2216
   goals met: 8 of 13
20. (debark person5 plane5 city2)
   deleted: (in person5 plane5)
   added: (at person5 city2)
   changed: (onboard plane5) from 3 to 2
   goals met: 9 of 13
21. (refuel plane5 city2)
   changed: (fuel plane5) from 2216 to 11656
   goals met: 9 of 13
22. (fly plane5 city2 city0)
   deleted: (at plane5 city2)
   added: (at plane5 city0)
   changed: (total-fuel-used) from 26326 to 28850, (fuel plane5) from 11656 to 9132
   goals met: 10 of 13
23. (debark person1 plane5 city0)
   deleted: (in person1 plane5)
   added: (at person1 city0)
   changed: (onboard plane5) from 2 to 1
   goals met: 11 of 13
24. (debark person8 plane5 city0)
   deleted: (in person8 plane5)
   added: (at person8 city0)
   changed: (onboard plane5) from 1 to 0
   goals met: 12 of 13
25. (fly plane4 city3 city1)
   deleted: (at plane4 city3)
   added: (at plane4 city1)
   changed: (total-fuel-used) from 28850 to 31480, (fuel plane4) from 4546 to 1916
   goals met: 11 of 13
26. (debark person6 plane4 city1)
   deleted: (in person6 plane4)
   added: (at person6 city1)
   changed: (onboard plane4) from 1 to 0
   goals met: 12 of 13
27. (refuel plane4 city1)
   changed: (fuel plane4) from 1916 to 15472
   goals met: 12 of 13
28. (fly plane4 city1 city3)
   deleted: (at plane4 city1)
   added: (at plane4 city3)
   changed: (total-fuel-used) from 31480 to 34110, (fuel plane4) from 15472 to 12842
   goals met: 13 of 13
